Repository: DavidWoo57/Pannotate-iOS
Catalog: Pannotate-iOS/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ai_services.api_key_placeholder
source: API Key
zh_hans: API 密钥

# ai_services.mock_mode
source: Mock Mode
zh_hans: 模拟模式

# ai_services.mock_required_message
source: Real providers are not connected yet, so Pannotate will keep using mock services for now.
zh_hans: 真实服务尚未接入，因此 Pannotate 目前会继续使用模拟服务。

# ai_services.mock_required_title
source: Mock Services Required
zh_hans: 需要使用模拟服务

# ai_services.not_connected
source: Not Connected
zh_hans: 未连接

# ai_services.ready_placeholder
source: Ready placeholder
zh_hans: 就绪占位

# ai_services.real_api_later
source: Real API integration will be added later
zh_hans: 真实 API 接入将在后续添加

# ai_services.settings_subtitle
source: Mock services and future API setup
zh_hans: 模拟服务与未来 API 设置

# ai_services.storage_note
source: API key fields are temporary UI-only placeholders and are not saved. Secure Keychain storage is still TODO.
zh_hans: API 密钥字段目前只是临时界面占位，不会保存。安全 Keychain 存储仍待实现。

# ai_services.title
source: AI Services
zh_hans: AI 服务

# ai_services.use_mock_services
source: Use Mock Services
zh_hans: 使用模拟服务

# ai_services.video_api_key
source: Video API Key
zh_hans: 视频 API 密钥

# ai_services.video_generation
source: Video Generation
zh_hans: 视频生成

# ai_services.video_generation_description
source: Video generation currently uses local mock jobs. Real API integration will be added later.
zh_hans: 视频生成当前使用本地模拟任务。真实 API 接入将在后续添加。

# ai_services.visual_llm_api_key
source: Visual LLM API Key
zh_hans: 视觉 LLM API 密钥

# ai_services.visual_understanding
source: Visual Understanding
zh_hans: 视觉理解

# ai_services.visual_understanding_description
source: Smart Mode currently uses a mock local interpretation. Real API integration will be added later.
zh_hans: 智能模式当前使用本地模拟理解。真实 API 接入将在后续添加。

# annotation.add_text
source: Add Text
zh_hans: 添加文字

# annotation.circle_hint
source: Drag to draw an ellipse around the subject or area to emphasize.
zh_hans: 拖动圈出要强调的主体或区域。

# annotation.draw_hint
source: Drag on the image to sketch guidance strokes.
zh_hans: 在图片上拖动以绘制引导笔画。

# annotation.editor.title
source: Annotation Editor
zh_hans: 标注编辑器

# annotation.eraser_hint
source: Tap or drag over an annotation to remove it.
zh_hans: 轻点或拖过标注即可移除。

# annotation.pan_hint
source: Pan is a safe mode. Existing text labels can still be repositioned.
zh_hans: 平移是安全模式。已有文字标签仍可移动。

# annotation.text_hint
source: Tap to add a label, or drag an existing label to reposition it.
zh_hans: 轻点添加文字，或拖动已有文字调整位置。

# annotation.text_placeholder
source: Annotation text
zh_hans: 标注文字

# annotation.tool.circle
source: Circle
zh_hans: 圈选

# annotation.tool.draw
source: Draw
zh_hans: 绘制

# annotation.tool.eraser
source: Eraser
zh_hans: 橡皮擦

# annotation.tool.pan
source: Pan
zh_hans: 平移

# annotation.tool.text
source: Text
zh_hans: 文字

# auth.account_mode
source: Account Mode
zh_hans: 账号模式

# auth.apple_mock_mode
source: Apple Mock
zh_hans: Apple 模拟

# auth.apple_placeholder_message
source: Apple sign-in will be added later.
zh_hans: Apple 登录将在后续添加。

# auth.apple_placeholder_title
source: Apple Sign-In
zh_hans: Apple 登录

# auth.continue_as_guest
source: Continue as Guest
zh_hans: 以访客身份继续

# auth.continue_with_apple
source: Continue with Apple
zh_hans: 通过 Apple 继续

# auth.continue_with_email
source: Continue with Email
zh_hans: 通过邮箱继续

# auth.continue_with_google
source: Continue with Google
zh_hans: 通过 Google 继续

# auth.email_mock_mode
source: Email Mock
zh_hans: 邮箱模拟

# auth.email_placeholder_message
source: Email sign-in will be added later.
zh_hans: 邮箱登录将在后续添加。

# auth.email_placeholder_title
source: Email Sign-In
zh_hans: 邮箱登录

# auth.google_mock_mode
source: Google Mock
zh_hans: Google 模拟

# auth.google_placeholder_message
source: Google sign-in will be added later.
zh_hans: Google 登录将在后续添加。

# auth.google_placeholder_title
source: Google Sign-In
zh_hans: Google 登录

# auth.guest_mode
source: Guest Mode
zh_hans: 访客模式

# auth.sign_out_confirmation_message
source: Your local projects will stay on this device.
zh_hans: 你的本地项目会保留在此设备上。

# auth.sign_out_confirmation_title
source: Are you sure you want to sign out?
zh_hans: 确定要退出登录吗？

# auth.tagline
source: Turn visual intent into video.
zh_hans: 把视觉意图转化为视频。

# auth.welcome_subtitle
source: Sign in later, or keep exploring locally as a guest.
zh_hans: 稍后登录，或以访客身份继续本地体验。

# auth.welcome_title
source: Welcome
zh_hans: 欢迎

# common.cancel
source: Cancel
zh_hans: 取消

# common.clear
source: Clear
zh_hans: 清除

# common.coming_soon
source: Coming Soon
zh_hans: 即将支持

# common.confirm
source: Confirm
zh_hans: 确认

# common.continue
source: Continue
zh_hans: 续接

# common.create
source: Create
zh_hans: 创建

# common.current
source: Current
zh_hans: 当前

# common.current_project
source: Current project
zh_hans: 当前项目

# common.delete
source: Delete
zh_hans: 删除

# common.details
source: Details
zh_hans: 详情

# common.done
source: Done
zh_hans: 完成

# common.edit
source: Edit
zh_hans: 编辑

# common.export
source: Export
zh_hans: 导出

# common.go_to_projects
source: Go to Projects
zh_hans: 前往项目

# common.just_now
source: Just now
zh_hans: 刚刚

# common.local_prototype_state_note
source: This updates local prototype state only.
zh_hans: 仅更新本地原型状态。

# common.name
source: Name
zh_hans: 名称

# common.next
source: Next
zh_hans: 下一步

# common.no
source: No
zh_hans: 否

# common.no_project
source: No project
zh_hans: 无项目

# common.no_project_selected
source: No project selected
zh_hans: 未选择项目

# common.not_captured
source: Not captured
zh_hans: 未记录

# common.ok
source: OK
zh_hans: 好

# common.preview
source: Preview
zh_hans: 预览

# common.project
source: Project
zh_hans: 项目

# common.remove
source: Remove
zh_hans: 移除

# common.rename
source: Rename
zh_hans: 重命名

# common.reset
source: Reset
zh_hans: 重置

# common.save
source: Save
zh_hans: 保存

# common.select_project_first
source: Select a project first
zh_hans: 请先选择项目

# common.skip
source: Skip
zh_hans: 跳过

# common.status
source: Status
zh_hans: 状态

# common.summary
source: Summary
zh_hans: 摘要

# common.undo
source: Undo
zh_hans: 撤销

# common.yes
source: Yes
zh_hans: 是

# developer_tools.add_failed_mock_job
source: Add Failed Mock Job
zh_hans: 添加失败任务

# developer_tools.add_failed_mock_job_subtitle
source: Add a failed output card for Retry testing.
zh_hans: 添加失败输出卡片以测试重试。

# developer_tools.add_sample_outputs
source: Add Sample Outputs
zh_hans: 添加示例输出

# developer_tools.add_sample_outputs_subtitle
source: Add completed and processing mock clips to the current project.
zh_hans: 向当前项目添加完成和处理中的模拟片段。

# developer_tools.add_sample_project
source: Add Sample Project
zh_hans: 添加示例项目

# developer_tools.add_sample_project_subtitle
source: Create and select a simple mock project.
zh_hans: 创建并选择一个简单示例项目。

# developer_tools.app_state_summary
source: App State Summary
zh_hans: 应用状态摘要

# developer_tools.are_you_sure
source: Are you sure?
zh_hans: 确定吗？

# developer_tools.auth_mode
source: Auth Mode
zh_hans: 登录模式

# developer_tools.auth_welcome_completed
source: Auth Welcome Completed
zh_hans: 已完成登录页

# developer_tools.auth_welcome_reset
source: Auth welcome reset
zh_hans: 登录页已重置

# developer_tools.cannot_undo
source: This action cannot be undone.
zh_hans: 此操作无法撤销。

# developer_tools.clear_all_local_data
source: Clear All Local Data
zh_hans: 清空本地数据

# developer_tools.clear_all_local_data_confirmation
source: This removes local prototype projects, outputs, sequences, and Studio state. This action cannot be undone.
zh_hans: 这会移除本地原型项目、输出、分镜和创作状态。此操作无法撤销。

# developer_tools.clear_all_local_data_subtitle
source: Remove local projects, outputs, sequences, and Studio state.
zh_hans: 移除本地项目、输出、分镜和创作状态。

# developer_tools.copy_summary
source: Copy Summary
zh_hans: 复制摘要

# developer_tools.current_project
source: Current Project
zh_hans: 当前项目

# developer_tools.debug_mode
source: Debug Mode
zh_hans: 调试模式

# developer_tools.failed_job_added
source: Failed mock job added
zh_hans: 失败任务已添加

# developer_tools.just_now
source: Just now
zh_hans: 刚刚

# developer_tools.language
source: Language
zh_hans: 语言

# developer_tools.language_follows_ios
source: Follows iOS App Language
zh_hans: 跟随 iOS 应用语言

# developer_tools.local_data_cleared
source: Local data cleared
zh_hans: 本地数据已清空

# developer_tools.onboarding_completed
source: Onboarding Completed
zh_hans: 已完成引导

# developer_tools.onboarding_reset
source: Onboarding reset
zh_hans: 引导页已重置

# developer_tools.output_count
source: Current Output Count
zh_hans: 当前输出数量

# developer_tools.project_count
source: Project Count
zh_hans: 项目数量

# developer_tools.reset_auth_welcome
source: Reset Auth Welcome
zh_hans: 重置登录页

# developer_tools.reset_auth_welcome_confirmation
source: The mock auth welcome screen will be shown again. Your local projects will stay on this device.
zh_hans: 模拟登录欢迎页将再次显示。你的本地项目会保留在此设备上。

# developer_tools.reset_auth_welcome_subtitle
source: Show the mock welcome/sign-in screen again.
zh_hans: 重新显示模拟欢迎/登录页面。

# developer_tools.reset_onboarding
source: Reset Onboarding
zh_hans: 重置引导页

# developer_tools.reset_onboarding_confirmation
source: Onboarding will be shown again. Your local projects will stay on this device.
zh_hans: 引导页将再次显示。你的本地项目会保留在此设备上。

# developer_tools.reset_onboarding_subtitle
source: Show onboarding again the next time the app flow refreshes.
zh_hans: 下次刷新应用流程时重新显示引导页。

# developer_tools.safety_note
source: Developer Tools only change local prototype state. No backend, cloud data, or real API credentials are touched.
zh_hans: 开发者工具只会更改本地原型状态，不会影响后端、云端数据或真实 API 凭据。

# developer_tools.sample_completed_clip_title
source: Sample Completed Clip
zh_hans: 示例完成片段

# developer_tools.sample_failed_clip_title
source: Sample Failed Job
zh_hans: 示例失败任务

# developer_tools.sample_failed_request_summary
source: Debug failed request generated locally.
zh_hans: 本地生成的失败调试请求。

# developer_tools.sample_final_prompt
source: Generate a smooth cinematic motion from the original image.
zh_hans: 从原始图片生成流畅的电影感运动。

# developer_tools.sample_outputs_added
source: Sample outputs added
zh_hans: 示例输出已添加

# developer_tools.sample_processing_clip_title
source: Sample Processing Clip
zh_hans: 示例处理中片段

# developer_tools.sample_project_added
source: Sample project added
zh_hans: 示例项目已添加

# developer_tools.sample_project_title
source: Sample Project
zh_hans: 示例项目

# developer_tools.sample_request_summary
source: Debug sample request generated locally.
zh_hans: 本地生成的调试示例请求。

# developer_tools.section.app_flow
source: App Flow
zh_hans: 应用流程

# developer_tools.section.local_data
source: Local Data
zh_hans: 本地数据

# developer_tools.selected_theme
source: Selected Theme
zh_hans: 当前主题

# developer_tools.sequence_count
source: Current Sequence Count
zh_hans: 当前分镜数量

# developer_tools.subtitle
source: Local prototype testing tools
zh_hans: 本地原型测试工具

# developer_tools.summary_copied
source: Summary copied
zh_hans: 摘要已复制

# developer_tools.title
source: Developer Tools
zh_hans: 开发者工具

# empty.outputs.go_to_studio
source: Go to Studio
zh_hans: 前往创作

# empty.outputs.message
source: Generated clips and mock jobs for this project will appear here.
zh_hans: 此项目的生成片段和模拟任务会显示在这里。

# empty.outputs.title
source: No clips yet
zh_hans: 还没有片段

# empty.projects.create_first
source: Create First Project
zh_hans: 创建第一个项目

# empty.projects.message
source: Projects organize your images, generated clips, outputs, and sequences in one place.
zh_hans: 项目会把图片、生成片段、输出和分镜整理在一起。

# empty.projects.title
source: Create your first project
zh_hans: 创建你的第一个项目

# empty.sequence.go_to_outputs
source: Go to Outputs
zh_hans: 前往输出

# empty.sequence.message
source: Add clips from Outputs to build a sequence and arrange your shot order.
zh_hans: 从输出中添加片段，创建分镜并整理镜头顺序。

# empty.sequence.title
source: Build your sequence
zh_hans: 创建你的分镜

# empty.studio.add_image
source: Add Image
zh_hans: 添加图片

# empty.studio.no_image.message
source: Choose a photo, adjust it, annotate what should move, then describe the motion.
zh_hans: 选择照片，调整画面，标注需要运动的内容，然后描述运动效果。

# empty.studio.no_image.title
source: Add an image to start creating
zh_hans: 添加图片开始创作

# empty.view_guide
source: View Guide
zh_hans: 查看引导

# generation.annotation_count
source: Annotation Count
zh_hans: 标注数量

# generation.annotation_summary
source: Annotation Summary
zh_hans: 标注摘要

# generation.confirm_generate
source: Confirm Generate
zh_hans: 确认生成

source: Generation Context
zh_hans: 生成上下文

# generation.context_continue_format
source: Continue from Last Frame Source clip: %@
zh_hans: 续接上一帧 来源片段：%@

# generation.context_new_shot
source: New Shot Source clip: None
zh_hans: 新镜头 来源片段：无

# generation.continue_from_last_frame
source: Continue from Last Frame
zh_hans: 续接上一帧

# generation.delete_failed_job
source: Delete failed job
zh_hans: 删除失败任务

source: Generation Details
zh_hans: 生成详情

# generation.duration
source: Duration
zh_hans: 时长

# generation.editable_final_prompt
source: Editable Final Prompt
zh_hans: 可编辑最终提示词

# generation.failed
source: Failed
zh_hans: 失败

# generation.failure_reason
source: Failure reason
zh_hans: 失败原因

# generation.fast_mode_prompt
source: Fast Mode Prompt
zh_hans: 快速模式提示词

# generation.final_video_prompt
source: Final Video Prompt
zh_hans: 最终视频提示词

# generation.generation_failed
source: Generation failed
zh_hans: 生成失败

# generation.image_preview
source: Image Preview
zh_hans: 图片预览

# generation.json_style_preview
source: JSON-Style Preview
zh_hans: JSON 样式预览

# generation.mock_generation_failed
source: Mock generation failed
zh_hans: 模拟生成失败

# generation.mode
source: Mode
zh_hans: 模式

# generation.new_shot
source: New Shot
zh_hans: 新镜头

# generation.normalized_annotation_data
source: Normalized Annotation Data
zh_hans: 标准化标注数据

# generation.original_generated_prompt
source: Original Generated Prompt
zh_hans: 原始生成提示词

# generation.prompt
source: Prompt
zh_hans: 提示词

# generation.prompt_used
source: Prompt Used For Generation
zh_hans: 生成使用的提示词

# generation.request_id
source: Request ID
zh_hans: 请求 ID

# generation.request_summary
source: Request Summary
zh_hans: 请求摘要

# generation.restore_generated_prompt
source: Restore generated prompt
zh_hans: 恢复生成的提示词

# generation.retry
source: Retry
zh_hans: 重试

# generation.review_generation
source: Review Generation
zh_hans: 确认生成

# generation.review_prompt_note
source: Review and revise the prompt that will be used by the mock generation service.
zh_hans: 检查并修改将用于模拟生成服务的提示词。

# generation.smart_mock_result
source: Simulated Smart Mode Result
zh_hans: 模拟智能结果

# generation.smart_payload
source: Smart Mode LLM-Ready Payload
zh_hans: 智能模式 LLM 载荷

# generation.something_went_wrong
source: Something went wrong
zh_hans: 出现了一点问题

# generation.source_clip
source: Source Clip
zh_hans: 来源片段

# generation.structured_fields
source: Structured Fields
zh_hans: 结构化字段

# generation.try_again
source: Try Again
zh_hans: 再试一次

# interpretation.fast
source: Fast
zh_hans: 快速

# interpretation.smart
source: Smart
zh_hans: 智能

# onboarding.get_started
source: Get Started
zh_hans: 开始使用

# onboarding.help_subtitle
source: Replay the quick Pannotate guide
zh_hans: 重新查看 Pannotate 快速指南

# onboarding.help_title
source: Help & Onboarding
zh_hans: 帮助与引导

# onboarding.page1.detail1
source: Mark what matters directly on the image.
zh_hans: 直接在图片上标出重点。

# onboarding.page1.detail2
source: Annotations are guidance for intent, not marks to render into the video.
zh_hans: 标注代表你的意图，不会作为画面元素生成。

# onboarding.page1.subtitle
source: Pannotate turns images, annotations, and motion prompts into clear video-generation instructions.
zh_hans: Pannotate 会把图片、标注和运动描述转化为清晰的视频生成指令。

# onboarding.page1.title
source: Create videos from visual intent
zh_hans: 用视觉意图生成视频

# onboarding.page2.detail1
source: Select or create a project first.
zh_hans: 先选择或新建一个项目。

# onboarding.page2.detail2
source: Studio, Outputs, and Sequence follow the current project.
zh_hans: 创作、输出和分镜都会归属于当前项目。

# onboarding.page2.subtitle
source: Projects keep your Studio work, Outputs, and Sequence organized together.
zh_hans: 项目会把创作、输出和分镜整理在一起。

# onboarding.page2.title
source: Start with a project
zh_hans: 先选择项目

# onboarding.page3.detail1
source: Use the Annotation Editor for draw, circle, text, and eraser tools.
zh_hans: 在标注编辑器中使用绘制、圈选、文字和橡皮擦。

# onboarding.page3.detail2
source: Preview the request before mock generation.
zh_hans: 模拟生成前可以预览请求内容。

# onboarding.page3.subtitle
source: Add an image, adjust the framing, annotate the subject, and describe the motion.
zh_hans: 添加图片，调整画面，标注主体，并描述运动效果。

# onboarding.page3.title
source: Build in Studio
zh_hans: 在创作页开始

# onboarding.page4.detail1
source: Fast uses local rule-based interpretation.
zh_hans: 快速模式使用本地规则理解。

# onboarding.page4.detail2
source: Smart currently uses mock visual understanding for future AI interpretation.
zh_hans: 智能模式当前使用模拟视觉理解，为未来 AI 理解做准备。

# onboarding.page4.subtitle
source: Fast and Smart modes interpret annotations differently before building the final prompt.
zh_hans: 快速和智能模式会以不同方式理解标注并生成最终提示词。

# onboarding.page4.title
source: Choose Fast or Smart
zh_hans: 选择快速或智能

# onboarding.page5.detail1
source: Open a clip to inspect generation details and the prompt used.
zh_hans: 打开片段可查看生成详情和使用的提示词。

# onboarding.page5.detail2
source: Continue starts a new clip from a previous clip’s last-frame context.
zh_hans: 续接会基于前一个片段的上一帧语境创建新片段。

# onboarding.page5.subtitle
source: Generated mock clips appear in Outputs for the current project.
zh_hans: 生成的模拟片段会出现在当前项目的输出中。

# onboarding.page5.title
source: Review Outputs and continue
zh_hans: 查看输出并续接

# onboarding.page6.detail1
source: Reorder clips in Edit mode.
zh_hans: 在编辑模式中调整片段顺序。

# onboarding.page6.detail2
source: Preview or export later when real video export is connected.
zh_hans: 未来接入真实视频导出后，可进行预览和导出。

# onboarding.page6.subtitle
source: Add generated clips to Sequence and arrange them into a simple shot order.
zh_hans: 把生成片段加入分镜，并整理成镜头顺序。

# onboarding.page6.title
source: Arrange a Sequence
zh_hans: 整理分镜

# outputs.add_to_sequence
source: Add to Sequence
zh_hans: 添加到分镜

# outputs.added_to_sequence
source: Added to sequence
zh_hans: 已添加到分镜

# outputs.already_in_sequence
source: Already in sequence
zh_hans: 已在分镜中

# outputs.clip_name
source: Clip name
zh_hans: 片段名称

# outputs.clip_preview
source: Clip Preview
zh_hans: 片段预览

# outputs.clip_preview_note
source: Real video playback will be connected later. This keeps the prototype tappable without adding media services.
zh_hans: 真实视频播放会稍后接入。当前保持原型可点击，不添加媒体服务。

# outputs.clip_preview_placeholder
source: Clip Preview Placeholder
zh_hans: 片段预览占位

# outputs.delete_clip
source: Delete Clip
zh_hans: 删除片段

# outputs.delete_clip_message
source: This removes the clip from Outputs in this local prototype session.
zh_hans: 这会从本地原型的输出中移除此片段。

# outputs.delete_clip_question
source: Delete Clip?
zh_hans: 删除片段？

# outputs.empty_message
source: No outputs for this project yet. Generate a mock clip in Studio to see it here.
zh_hans: 此项目还没有输出。在创作页生成一个模拟片段后会显示在这里。

# outputs.for_project
source: Outputs for
zh_hans: 输出

# outputs.no_project_message
source: Outputs are grouped by the current project. Choose or create a project to view generated clips.
zh_hans: 输出按当前项目分组。请选择或创建项目以查看生成片段。

# outputs.rename_clip
source: Rename Clip
zh_hans: 重命名片段

# outputs.selected_output_clip
source: Selected output clip
zh_hans: 所选输出片段

# outputs.subtitle_for_project_format
source: Outputs for %@
zh_hans: %@ 的输出

# profile.account_support
source: Account & Support
zh_hans: 账户与支持

# profile.clips
source: Clips
zh_hans: 片段

# profile.export_coming_soon
source: Export coming soon
zh_hans: 导出即将支持

# profile.exports
source: Exports
zh_hans: 导出

# profile.generated_clip
source: Generated clip
zh_hans: 已生成片段

# profile.guest_user
source: Guest User
zh_hans: 访客用户

# profile.help
source: Help
zh_hans: 帮助

# profile.help_subtitle
source: Prototype support placeholder
zh_hans: 原型支持占位

# profile.local_prototype
source: Local Prototype
zh_hans: 本地原型

# profile.mock_credits
source: Mock Credits
zh_hans: 模拟额度

# profile.monthly_credits
source: Monthly Credits
zh_hans: 每月额度

# profile.no_recent_activity
source: No recent activity yet
zh_hans: 暂无最近活动

# profile.placeholder_detail_note
source: This is a simple local prototype screen. Real account, support, payment, and store logic will be connected later.
zh_hans: 这是一个简单的本地原型页面。真实账户、支持、支付和商店逻辑会稍后接入。

# profile.privacy
source: Privacy
zh_hans: 隐私

# profile.privacy_subtitle
source: Data controls placeholder
zh_hans: 数据控制占位

# profile.prototype_credits
source: Prototype Credits
zh_hans: 原型额度

# profile.rate_pannotate
source: Rate Pannotate
zh_hans: 评价 Pannotate

# profile.rate_pannotate_subtitle
source: App Store prompt placeholder
zh_hans: App Store 提示占位

# profile.recent_activity
source: Recent Activity
zh_hans: 最近活动

# profile.subscription_subtitle
source: Manage Pro Creator plan
zh_hans: 管理 Pro Creator 方案

# projects.clip_metadata_format
source: %d clips · %@
zh_hans: %d 个片段 · %@

# projects.copy_format
source: %@ Copy
zh_hans: %@ 副本

# projects.create_new_project
source: Create New Project
zh_hans: 新建项目

# projects.current_project
source: Current Project
zh_hans: 当前项目

# projects.delete_project
source: Delete Project
zh_hans: 删除项目

# projects.delete_project_message
source: This removes the project from this local prototype session.
zh_hans: 这会从本地原型中移除此项目。

# projects.delete_project_question
source: Delete Project?
zh_hans: 删除项目？

# projects.detail_placeholder
source: Project detail placeholder
zh_hans: 项目详情占位

# projects.duplicate_project
source: Duplicate Project
zh_hans: 复制项目

# projects.image_placeholder
source: Image Placeholder
zh_hans: 图片占位

# projects.image_placeholder_note
source: A real image picker comes later. For now this creates a local mock project.
zh_hans: 真实图片选择稍后接入。当前会创建本地模拟项目。

# projects.make_current
source: Make Current
zh_hans: 设为当前

# projects.new_project
source: New Project
zh_hans: 新项目

# projects.project_clips
source: Project Clips
zh_hans: 项目片段

# projects.project_clips_message
source: Clip browsing for this project will be connected later in the prototype.
zh_hans: 此项目的片段浏览会在后续原型中接入。

# projects.project_name
source: Project name
zh_hans: 项目名称

# projects.recent_projects
source: Recent Projects
zh_hans: 最近项目

# projects.rename_project
source: Rename Project
zh_hans: 重命名项目

# projects.subtitle
source: Your creative workspace
zh_hans: 你的创作工作区

# projects.untitled_project
source: Untitled Project
zh_hans: 未命名项目

# projects.view_clips
source: View Clips
zh_hans: 查看片段

# sequence.add_clip
source: Add Clip
zh_hans: 添加片段

# sequence.add_clip_message
source: Clip selection will be wired to generated outputs later. For now this is a local prototype placeholder.
zh_hans: 片段选择稍后会连接到生成输出。当前是本地原型占位。

# sequence.continues_from_previous_frame
source: Continues from previous frame
zh_hans: 从上一帧续接

# sequence.empty_message
source: Add clips from Outputs or use Add clip when you are ready to arrange a mock sequence.
zh_hans: 可从输出添加片段，或使用添加片段来编排模拟分镜。

# sequence.empty_title
source: No clips in this sequence yet
zh_hans: 分镜中还没有片段

# sequence.export_complete
source: Export Complete
zh_hans: 导出完成

# sequence.export_complete_message
source: Your mock sequence export is ready. Real video export will come later.
zh_hans: 模拟分镜导出已完成。真实视频导出会稍后接入。

# sequence.exporting
source: Exporting...
zh_hans: 正在导出…

# sequence.for_project
source: Sequence for
zh_hans: 分镜

# sequence.move_down
source: Move Down
zh_hans: 下移

# sequence.move_up
source: Move Up
zh_hans: 上移

# sequence.no_project_message
source: Sequences are scoped to the current project. Choose or create a project before arranging clips.
zh_hans: 分镜属于当前项目。请先选择或创建项目再编排片段。

# sequence.preview_message
source: This is a mock preview placeholder. Real timeline playback will be added later.
zh_hans: 这是模拟预览占位。真实时间线播放会稍后加入。

# sequence.preview_title
source: Sequence Preview
zh_hans: 分镜预览

# sequence.remove_clip_message
source: This removes the clip from the local mock sequence.
zh_hans: 这会从本地模拟分镜中移除此片段。

# sequence.remove_clip_question
source: Remove Clip?
zh_hans: 移除片段？
